docs: developer documentation
